# Python review2 Django web service

## Запуск сервиса
Предполагается, что:
- Код прогоняется на Linux/MacOS (иначе могут возникнуть непредвиденные проблемы)
- Docker установлен на машину

Находясь в корне репозитория, соберите Docker образ:
```bash
docker build  -t django-highload:latest .
```

После того, как образ собрался, запустите все необходимые контейнеры:
```bash
docker compose up -d
```

## Остановка сервиса

Чтобы остановить контейнеры:
```bash
docker compose stop
```

Чтобы удалить остановленные контейнеры без удаления томов:
```bash
docker compose down
```

Чтобы удалить остановленные контейнеры с удалением томов:
```bash
docker compose down -v
```

## Функционал сервиса

Remark: Ссылки с учетом локального запуска

Ручки:
- http://localhost/: При вызове,
  - Если модель обучена, то откроется окно с полем ввода ссылки на фильм из википедии и выбором количества поиска схожих картин
  - Если модель не обучена, то выведется надпись с интерактивной кнопкой, которая позволяет обучить модель
- http://localhost/train: При вызове, модель будет обучена (если уже была обучена, то будет обучена заново)
- http://localhost/similar?url=your_url&cnt=number_of_similar: При вызове,
  - Если модель обучена, то по `your_url` можно будет найти `number_of_similar` похожих фильмов
  - Если модель не обучена, то выведется надпись с интерактивной кнопкой, которая позволяет обучить модель

## Основной сценарий пользования сервисом

Сценарий:
1. Заходишь на http://localhost/
2. Нажимаешь на кнопку "train"
3. Появится надпись, что модель обучается (иногда пролагивает и не появляется надпись) и нужно немного подождать
4. Переходишь на http://localhost/
5. Вводишь ссылку на статью (английскую) на википедии о фильме и выбираешь число похожих, которые хочешь получить. Нажимаешь Enter
6. Ждешь пока модель отработает и перенаправит на страницу с результатами (там будет список похожих фильмов с ссылкой и описанием)
7. Есть два варианты:
   - Повторяешь шаги 4-6
   - Переходишь на http://localhost/train, чтобы заново обучить модель и повторяешь шаги 3-6

P.S. Прикиньте, если бы современные сервисы так работали :)
